[
  {
    "id": "1",
    "title": "The Midnight Library",
    "author": "Matt Haig",
    "rating": 4.2,
    "description": "In a library between life and death, Nora Seed finds herself with the chance to rewrite her story. Each book on the shelves offers a glimpse into a different path—what could have been if she had made different choices.\n\nAs she explores these alternate realities, Nora begins to uncover the things that truly matter. 'The Midnight Library' is a poignant and imaginative novel that explores regret, possibility, and the courage it takes to live.",
    "price": 12.99,
    "image": "https://litbooks.com.my/wp-content/uploads/2022/06/9781786892737.jpg.webp",
    "genre": "Fantasy",
    "publication_year": 2020,
    "stockAvailable": 10
  },
  {
    "id": "2",
    "title": "Atomic Habits",
    "author": "James Clear",
    "rating": 4.8,
    "description": "Forming good habits doesn't have to be a struggle. In 'Atomic Habits', James Clear breaks down the science behind how habits are formed and shows readers simple, actionable steps to build lasting routines.\n\nPacked with insights from psychology, neuroscience, and real-world examples, this book offers a proven framework for transformation. Whether you're looking to improve your career, health, or relationships, Clear’s strategies make it attainable.",
    "price": 6.0,
    "image": "https://images-na.ssl-images-amazon.com/images/I/91bYsX41DVL.jpg",
    "genre": "Self-help",
    "publication_year": 2018,
    "stockAvailable": 5
  },
  {
    "id": "3",
    "title": "The Alchemist",
    "author": "Paulo Coelho",
    "rating": 4.7,
    "description": "Santiago, a young Andalusian shepherd, dreams of a treasure hidden in the Egyptian pyramids. He sets out on a quest that takes him across continents in pursuit of a dream that keeps calling to him.\n\nBut the journey becomes more than just a physical adventure—it becomes a journey of self-discovery. 'The Alchemist' is a timeless tale about listening to your heart and embracing the path of your personal legend.",
    "price": 10.5,
    "image": "https://images-na.ssl-images-amazon.com/images/I/71aFt4+OTOL.jpg",
    "genre": "Adventure",
    "publication_year": 1988,
    "stockAvailable": 20
  },
  {
    "id": "4",
    "title": "Where the Crawdads Sing",
    "author": "Delia Owens",
    "rating": 4.5,
    "description": "In the marshes of North Carolina, Kya Clark grows up isolated from the townspeople who call her 'Marsh Girl.' When a local man is found dead, suspicions quickly turn to her.\n\nThe novel weaves together a gripping murder mystery with a touching coming-of-age story. It's also a love letter to the wild beauty of nature and the resilience of those who live on its margins.",
    "price": 14.99,
    "image": "https://litbooks.com.my/wp-content/uploads/2022/04/81HA6TJ5K-L.jpg.webp",
    "genre": "Mystery",
    "publication_year": 2018,
    "stockAvailable": 12
  },
  {
    "id": "5",
    "title": "Becoming",
    "author": "Michelle Obama",
    "rating": 4.9,
    "description": "From her childhood on the South Side of Chicago to her years as First Lady of the United States, Michelle Obama recounts her extraordinary journey with grace and honesty.\n\nIn 'Becoming', she shares personal reflections on her role as a mother, a leader, and a public figure navigating uncharted waters. It’s an inspiring memoir that encourages readers to find their voice and own their story.",
    "price": 18.95,
    "image": "https://images-na.ssl-images-amazon.com/images/I/81h2gWPTYJL.jpg",
    "genre": "Memoir",
    "publication_year": 2018,
    "stockAvailable": 15
  },
  {
    "id": "6",
    "title": "Educated",
    "author": "Tara Westover",
    "rating": 4.7,
    "description": "Raised in a strict and isolated household in rural Idaho, Tara Westover never stepped foot in a classroom until the age of seventeen. Her thirst for knowledge led her on a remarkable journey—from self-taught learner to earning a PhD from Cambridge.\n\n'Educated' is a memoir about the struggle for self-invention, the clash between loyalty to family and loyalty to oneself, and the power of education to transform a life.",
    "price": 13.99,
    "image": "https://images-na.ssl-images-amazon.com/images/I/81WojUxbbFL.jpg",
    "genre": "Memoir",
    "publication_year": 2018,
    "stockAvailable": 7
  },
  {
    "id": "7",
    "title": "The Subtle Art of Not Giving a F*ck",
    "author": "Mark Manson",
    "rating": 4.3,
    "description": "Mark Manson delivers a raw, refreshing perspective on how to live a better life—not by avoiding problems, but by learning how to deal with them better. His no-nonsense advice is built on the idea that life’s struggles give it meaning.\n\nBlending humor, personal stories, and psychological research, this book offers readers permission to care less about unimportant things and more about what really matters. It’s a guide to developing resilience and clarity in an increasingly chaotic world.",
    "price": 15.2,
    "image": "https://images-na.ssl-images-amazon.com/images/I/71QKQ9mwV7L.jpg",
    "genre": "Self-help",
    "publication_year": 2016,
    "stockAvailable": 5
  },
  {
    "id": "8",
    "title": "Daisy Jones & The Six",
    "author": "Taylor Jenkins Reid",
    "rating": 4.4,
    "description": "Told in an oral-history format, 'Daisy Jones & The Six' captures the rise and fall of a fictional 1970s rock band. Through interviews with band members and those around them, the novel paints a vivid picture of fame, creativity, and heartbreak.\n\nAs secrets unravel and egos collide, the story dives deep into the tensions that drove the band to greatness—and ultimately to break apart. It's a gripping and immersive narrative filled with passion, music, and nostalgia.",
    "price": 13.45,
    "image": "https://litbooks.com.my/wp-content/uploads/2020/04/9781524798642.jpg.webp",
    "genre": "Historical Fiction",
    "publication_year": 2019,
    "stockAvailable": 3
  },
  {
    "id": "9",
    "title": "Free Food For Millionaires",
    "author": "Min Jin Lee",
    "rating": 4.6,
    "description": "Casey Han, a Princeton graduate from a Korean immigrant family, finds herself torn between two cultures and struggling to forge a life of her own. Ambitious and intelligent, Casey craves wealth and independence but often finds herself at odds with society’s expectations.\n\nThis richly layered novel explores identity, ambition, class, and the sacrifices made for belonging. It’s a sweeping story of family, privilege, and the pursuit of self-worth in modern America.",
    "price": 11.8,
    "image": "https://litbooks.com.my/wp-content/uploads/2024/01/81xQsELYRCL._SL1500_.jpg.webp",
    "genre": "General Fiction",
    "publication_year": 2018,
    "stockAvailable": 2
  },
  {
    "id": "10",
    "title": "It Ends With Us",
    "author": "Colleen Hoover",
    "rating": 4.7,
    "description": "Lily Bloom appears to have it all: a new city, a blossoming career, and a charming love interest. But when the darkness of her past begins to echo in her present relationship, she is forced to confront difficult truths.\n\n'It Ends With Us' is a powerful and emotional story about love, strength, and the decisions that define us. Hoover tackles tough themes like abuse and trauma with honesty and sensitivity, delivering a story that resonates deeply with readers.",
    "price": 12.0,
    "image": "https://images-na.ssl-images-amazon.com/images/I/81s0B6NYXML.jpg",
    "genre": "Romance",
    "publication_year": 2016,
    "stockAvailable": 22
  },
  {
    "id": "11",
    "title": "1984",
    "author": "George Orwell",
    "rating": 4.6,
    "description": "In a chilling dystopia ruled by Big Brother, individual freedom is crushed beneath the weight of totalitarian control. Winston Smith, a low-ranking Party member, dares to question the regime, seeking truth in a world built on lies.\n\n'1984' is a timeless warning about surveillance, censorship, and the manipulation of truth. Orwell's masterpiece remains disturbingly relevant, challenging readers to reflect on power, control, and resistance.",
    "price": 9.99,
    "image": "https://images-na.ssl-images-amazon.com/images/I/71kxa1-0mfL.jpg",
    "genre": "Dystopian",
    "publication_year": 1949,
    "stockAvailable": 30
  },
  {
    "id": "12",
    "title": "The Silent Parade",
    "author": "Keigo Higashino",
    "rating": 4.4,
    "description": "When a beloved young woman is found murdered, suspicion falls on a man who had previously escaped justice. Years later, as tensions rise in the neighborhood, the case resurfaces with shocking consequences.\n\nBlending psychological depth with procedural intrigue, 'The Silent Parade' is a gripping mystery that challenges assumptions and keeps readers guessing until the final page. Keigo Higashino once again proves his mastery of the suspense genre.",
    "price": 13.75,
    "image": "https://litbooks.com.my/wp-content/uploads/2021/12/61KMDiWUCSL.jpg",
    "genre": "Thriller",
    "publication_year": 2019,
    "stockAvailable": 3
  },
  {
    "id": "13",
    "title": "The Original Daughter",
    "author": "Jemimah Wei",
    "rating": 4.8,
    "description": "In this compelling blend of myth and memory, 'The Original Daughter' explores the spiritual and emotional complexities of identity. Rooted in cultural heritage and personal mythology, the narrative challenges conventions and embraces transformation.\n\nJemimah Wei crafts a story that is at once deeply personal and universally resonant. Through lyrical prose and introspective depth, the novel becomes a meditation on family, truth, and spiritual awakening.",
    "price": 8.99,
    "image": "https://litbooks.com.my/wp-content/uploads/2025/05/9781399625586.jpg",
    "genre": "Spirituality",
    "publication_year": 1997,
    "stockAvailable": 1
  },
  {
    "id": "14",
    "title": "Careless People",
    "author": "Sarah Wynn-Williams",
    "rating": 4.7,
    "description": "Set in Nazi Germany, 'Careless People' follows a young girl who finds refuge from the horrors around her by stealing books. Through her love of words and stories, she discovers hope, humanity, and the courage to resist.\n\nWith poetic grace and emotional force, Sarah Wynn-Williams crafts a tale that is as heartbreaking as it is inspiring. It’s a reminder of the enduring power of literature in the darkest of times.",
    "price": 11.6,
    "image": "https://litbooks.com.my/wp-content/uploads/2025/05/71Jpa9BVIDL._SL1500_.jpg",
    "genre": "Historical Fiction",
    "publication_year": 2005,
    "stockAvailable": 15
  },
  {
    "id": "15",
    "title": "Fundamentally",
    "author": "Nussaibah Younis",
    "rating": 4.8,
    "description": "When a catastrophic event threatens Earth, a lone astronaut must undertake a perilous mission that could determine the fate of humanity. But survival in space is only part of the challenge—what awaits back home is just as daunting.\n\n'Fundamentally' is a thrilling science fiction novel that blends action with philosophical reflection. It explores themes of isolation, sacrifice, and the fundamental questions that drive human progress.",
    "price": 17.99,
    "image": "https://litbooks.com.my/wp-content/uploads/2025/04/9781399623933.jpg",
    "genre": "Science Fiction",
    "publication_year": 2021,
    "stockAvailable": 8
  },
  {
    "id": "16",
    "title": "Growth",
    "author": "Daniel Susskind",
    "rating": 4.8,
    "description": "In a world increasingly shaped by innovation and automation, how do we continue to grow—economically, socially, and intellectually? 'Growth' explores the modern dilemmas of advancement and the costs that often come with it.\n\nSusskind challenges readers to rethink traditional notions of progress, urging us to consider not just what we grow, but how and why. It’s a thought-provoking read for anyone interested in the future of humanity and the planet.",
    "price": 17.99,
    "image": "https://litbooks.com.my/wp-content/uploads/2025/04/71TX1iBYsL._SL1500_.jpg",
    "genre": "Science Fiction",
    "publication_year": 2021,
    "stockAvailable": 3
  }
]
